Docs/initial-scope-and-estimates/mplsCorwin.org
* Corwin's Dungeon

This is my personal notes file for dungeon-mode.  Below are the
directions for the initial sprints of the project.  The remainder of
the document forms my contribution as toward delivering on that.

#+begin_quote
1. (Dec 22 - Jan 5th) High Level Effort Guesstimation for both
   Interface Development and Manual Authoring.  Task lists and
   estimates to this channel whenever and feel free to revise and
   extend your remarks.  For extra credit, download GNU Emacs (I like
   Emax64 26.2 or 26.3 for Windows 10) and try making your notes using
   org mode.

2. (Jan. 5th - Jan 19th) User journey and user story creation.  What
   are the key user and system interactions?  What orders may they
   occur in?  How may this map to our interfaces (e.g. major and minor
   modes)?  What tasks are needed to deliver that functionality and
   how long might all that take?  Finally, considering both of the
   first two sprints, what items are "above the line" in the sense
   they should be assumed to be required to complete a minimum
   testable product.  For extra credit in sprint two make org mode
   sort tasks based on priority (and dependencies?) and sum cost
   (time)
#+end_quote

* SYNOPSIS

My most current dungeon lives principally within a Google Docs
spreadsheet, and should be fairly straight forward to convert to elisp
statements.  Deeper in the document I provide some design detail from
spreadsheet in as much as this may suggest the key files or macros or
whatever.

From a UI design perspective my focus, in terms of an initial MPTP for
the first use-case, is getting a comfortable and familiar sense of
graph paper and pencil, maybe high-lighter and felt-tipped markers.

In the remaining sections I'll rationalize these motivations further
as then relate to key development tasks I think could factor into an
Minimum Play-Testable Product (MPTP).

* Initial Estimations

The section currently only contains information responding to sprint 1
e.g. user interface development and the manual authoring of content.

** Interface Development

| Tags                | Points |
| dungeon-mode        |     20 |
| journal-mode        |     20 |
| battle-board        |     10 |
| baddie-board        |      5 |
| map-mode            |     20 |
| treasure-mode       |     10 |
| character-mode      |     20 |
| tables-mode         |     10 |
| decent-mode         |      5 |
| dungeon-master-mode |     20 |

The remainder of the section forms initial task objective generally in
the vein of user stories and any recommendations, analysis and notes
which contributed..

*** Task Detail

**** Create dungeon-mode (20 points)
#+begin_quote
Oversee file interactions in terms of expression. Use a queue and
timer to insulate the command processing function.  This package will
not perform the file operations so this task must leap-frog or
otherwise coordinate within initial development of 'dm-journal-mode'.
#+end_quote

**** Create dm-journal-mode (20 points)
#+begin_quote
Create basic file-system interaction functions, (1) create an empty
file associated to a given symbol, (2) given a symbol return file
content, (3) given a symbol return the index of symbols it defines,
(4) given a symbol return the file or file part which defined it, (5)
given an indexed symbol and new content update the file.
#+end_quote

**** Create dm-battle-board (20 points)
#+begin_quote
Draw a party in terms of position and attributes. (body-hits, ...)
Provide a frame-work for font (e.g. ASCII, Unicode, ...) based
beautification.  Make decorative content read-only.
#+end_quote

**** Create dm-baddie-board (5 points)
#+begin_quote
Display baddies as viewed by the party or DM, e.g maybe no or limited
health info per party's current view.  It is fine to use hard-coded
data if the REPL is not available.
#+end_quote

**** Create dm-map-mode (20 points)
#+begin_quote
Display a map with a general store, corridor, and chambers behind
secret doors and super-impose it over the data representation. Key
constants may be hard-coded or implemented as vars however drawing
must occur on-demand, must replace any existing image, and must
include calculations of scale, a sizing factor from 0-4 which may be
hard coded to 1 (100%) for the time-being.
#+end_quote

**** Create dm-treasure-mode (10 points)
#+begin_quote
Display the treasure categories, including unresolved or undistributed
treasure.  Provide functions and key-map with bindings to (1)
increment and (2) decrement numeric counters, (3) add or (4) remove an
item from a list column, and to (5, 6) DWIM at point category at
point.  It is helpful but not required to select key bindings
thoughtfully at this stage in development.
#+end_quote

**** Create dm-tables-mode (10 points)
#+begin_quote
Display a sample of any of the common DM tables, e.g. spells.  Use
hard-coded data if the REPL isn't ready.  Support basic cell-wise
cursor movement with arrow keys.  Highlight the cell under point.  It
is not required (but helpful) to include restriction of point to
appropriate (interactive) spaces within the buffer.
#+end_quote

**** Create dm-character-mode (20 points
#+begin_quote
Display a character sheet.  Implement a reasonably well considered
UI. Provide a key-map with minimal bindings for movement between
sections.
#+end_quote

**** dm-decent-mode (5 points)
#+begin_quote
Display a dired like interface of buffers important to dungeon-mode.
#+end_quote

**** dm-dungeon-master-mode (20 points)
#+begin_quote
Prototype composite interface two working minor modes and the REPL.
Note, while the REPL must be at least semi-functional to complete this
task this will also provide a POC for dm-battle-board-mode proposed
approach.
#+end_quote

