Docs/initial-scope-and-estimates/mplsCorwin.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-25 Wed 08:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Corwin Brust" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2d4a467">1. Corwin's Dungeon</a></li>
<li><a href="#org690dc46">2. SYNOPSIS</a></li>
<li><a href="#org38b67e9">3. Initial Estimations</a>
<ul>
<li><a href="#org406ee76">3.1. Interface Development</a>
<ul>
<li><a href="#orgf1595e9">3.1.1. Task Detail</a></li>
</ul>
</li>
<li><a href="#orgceb2e8e">3.2. Analysis</a>
<ul>
<li><a href="#org962fcbd">3.2.1. Recommendation: Rendering non-text content</a></li>
</ul>
</li>
<li><a href="#orgd802f33">3.3. <span class="todo TODO">TODO</span> Manual Data Entry</a></li>
</ul>
</li>
<li><a href="#orgfa23eb5">4. Quick Notes on Data</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2d4a467" class="outline-2">
<h2 id="org2d4a467"><span class="section-number-2">1</span> Corwin's Dungeon</h2>
<div class="outline-text-2" id="text-1">
<p>
This is my personal notes file for dungeon-mode.  Below are the
directions for the initial sprints of the project.  The remainder of
the document forms my contribution as toward delivering on that.
</p>

<blockquote>
<ol class="org-ol">
<li>(Dec 22 - Jan 5th) High Level Effort Guesstimation for both
Interface Development and Manual Authoring.  Task lists and
estimates to this channel whenever and feel free to revise and
extend your remarks.  For extra credit, download GNU Emacs (I like
Emax64 26.2 or 26.3 for Windows 10) and try making your notes using
org mode.</li>

<li>(Jan. 5th - Jan 19th) User journey and user story creation.  What
are the key user and system interactions?  What orders may they
occur in?  How may this map to our interfaces (e.g. major and minor
modes)?  What tasks are needed to deliver that functionality and
how long might all that take?  Finally, considering both of the
first two sprints, what items are "above the line" in the sense
they should be assumed to be required to complete a minimum
testable product.  For extra credit in sprint two make org mode
sort tasks based on priority (and dependencies?) and sum cost
(time)</li>
</ol>
</blockquote>
</div>
</div>

<div id="outline-container-org690dc46" class="outline-2">
<h2 id="org690dc46"><span class="section-number-2">2</span> SYNOPSIS</h2>
<div class="outline-text-2" id="text-2">
<p>
My most current dungeon lives principally within a Google Docs
spreadsheet, and should be fairly straight forward to convert to elisp
statements.  Deeper in the document I provide some design detail from
spreadsheet in as much as this may suggest the key files or macros or
whatever.
</p>

<p>
From a UI design perspective my focus, in terms of an initial MPTP for
the first use-case, is getting a comfortable and familiar sense of
graph paper and pencil, maybe high-lighter and felt-tipped markers.
</p>

<p>
In the remaining sections I'll rationalize these motivations further
as then relate to key development tasks I think could factor into an
Minimum Play-Testable Product (MPTP).
</p>
</div>
</div>

<div id="outline-container-org38b67e9" class="outline-2">
<h2 id="org38b67e9"><span class="section-number-2">3</span> Initial Estimations</h2>
<div class="outline-text-2" id="text-3">
<p>
The section currently only contains information responding to sprint 1
e.g. user interface development and the manual authoring of content.
</p>
</div>

<div id="outline-container-org406ee76" class="outline-3">
<h3 id="org406ee76"><span class="section-number-3">3.1</span> Interface Development</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Tags</td>
<td class="org-right">Points</td>
</tr>

<tr>
<td class="org-left">dungeon-mode</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">battle-board</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-left">baddie-board</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">map-mode</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">treasure-mode</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-left">character-mode</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">tables-mode</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-left">decent-mode</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">dungeon-master-mode</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">journal-mode</td>
<td class="org-right">16</td>
</tr>
</tbody>
</table>

<p>
The remainder of the section forms initial task objective generally in
the vein of user stories and any recomendations, analysis and notes
which contributed..
</p>
</div>

<div id="outline-container-orgf1595e9" class="outline-4">
<h4 id="orgf1595e9"><span class="section-number-4">3.1.1</span> Task Detail</h4>
<div class="outline-text-4" id="text-3-1-1">
</div>
<ol class="org-ol">
<li><a id="org8b0ab06"></a>Create dungeon-mode (20 points)<br />
<div class="outline-text-5" id="text-3-1-1-1">
<blockquote>
<p>
Oversee file interactions in terms of elisp expresisons. Use a queue
and timer to insulate the command processing function.  This package
will not perform the file operations so this task must leap-frog or
otherwise coordinate within initial development of 'dm-journal-mode'.
</p>
</blockquote>
</div>
</li>

<li><a id="org08455d4"></a>Create dm-journal-mode (20 points)<br />
<div class="outline-text-5" id="text-3-1-1-2">
<blockquote>
<p>
Create basic file-system interaction functions, (1) create an empty
file associated to a given symbol, (2) given a symbol return file
content, (4) read a file an index the symbols defined, (5) given a
symbol return the file or file part where it is defined.
</p>
</blockquote>
</div>
</li>

<li><a id="org3a26e9b"></a>Create dm-battle-board (20 points)<br />
<div class="outline-text-5" id="text-3-1-1-3">
<blockquote>
<p>
Draw a party in terms of position and attributes. (body-hits, &#x2026;)
Provide a frame-work for font (e.g. ASCII, Unicode, &#x2026;) based
beautification.  Make decorative content read-only.
</p>
</blockquote>
</div>
</li>

<li><a id="orgaea2244"></a>Create dm-baddie-board (5 points)<br />
<div class="outline-text-5" id="text-3-1-1-4">
<blockquote>
<p>
Display baddies as viewed by the party or DM, e.g maybe no or limited
health info per party's current view.  It is fine to use hard-coded
data if the REPL is not available.
</p>
</blockquote>
</div>
</li>

<li><a id="orgb974fb1"></a>Create dm-map-mode (20 points)<br />
<div class="outline-text-5" id="text-3-1-1-5">
<blockquote>
<p>
Display a map with a general store, corridor, and chambers behind
secret doors and super-impose it over the data representation. Key
constants may be hard-coded or implemented as vars however drawing
must occur on-demand, must replace any existing image, and must
include calculations of scale, a sizing factor from 0-4 which may be
hard coded to 1 (100%) for the time-being.
</p>
</blockquote>
</div>
</li>

<li><a id="orgafc54ca"></a>Create dm-treasure-mode (10 points)<br />
<div class="outline-text-5" id="text-3-1-1-6">
<blockquote>
<p>
Display the treasure categories, including unresolved or undistributed
treasure.  Provide functions and key-map with bindings to (1)
increment and (2) decrement numeric counters, (3) add or (4) remove an
item from a list column, and to (5, 6) DWIM at point category at
point.  It is helpful but not required to select key bindings
thoughtfully at this stage in development.
</p>
</blockquote>
</div>
</li>

<li><a id="org7c9a00c"></a>Create dm-tables-mode (10 points)<br />
<div class="outline-text-5" id="text-3-1-1-7">
<blockquote>
<p>
Display a sample of any of the common DM tables, e.g. spells.  Use
hard-coded data if the REPL isn't ready.  Support basic cell-wise
cursor movement with arrow keys.  Highlight the cell under point.  It
is not required (but helpful) to include restriction of point to
appropriate (interactive) spaces within the buffer.
</p>
</blockquote>
</div>
</li>

<li><a id="orgea7da15"></a>Create dm-character-mode (20 points<br />
<div class="outline-text-5" id="text-3-1-1-8">
<blockquote>
<p>
Display a character sheet.  Implement a reasonably well considered
UI. Provide a key-map with minimal bindings for movement between
sections.
</p>
</blockquote>
</div>
</li>

<li><a id="orgb46bef7"></a>dm-decent-mode (5 points)<br />
<div class="outline-text-5" id="text-3-1-1-9">
<blockquote>
<p>
Display a dired like interface of buffers important to dungeon-mode.
</p>
</blockquote>
</div>
</li>

<li><a id="orge44abc8"></a>dm-dungeon-master-mode (20 points)<br />
<div class="outline-text-5" id="text-3-1-1-10">
<blockquote>
<p>
Prototype composite interface two working minor modes and the REPL.
Note, while the REPL must be at least semi-functional to complete this
task this will also provide a POC for dm-battle-board-mode proposed
approach.
</p>
</blockquote>
</div>
</li>
</ol>
</div>
</div>
