Docs/initial-scope-and-estimates/mplsCorwin.html

<div id="outline-container-orgfa23eb5" class="outline-2">
<h2 id="orgfa23eb5"><span class="section-number-2">4</span> Quick Notes on Data</h2>
<div class="outline-text-2" id="text-4">
<p>
We might be able to map key dungeon concepts to Emacs Lisp grouping
syntax if we select our abstractions carefully:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">dm abstract</td>
<td class="org-left">grouped by</td>
<td class="org-left">wut?</td>
</tr>

<tr>
<td class="org-left">table</td>
<td class="org-left">() list</td>
<td class="org-left">wrap a victual or baddie table</td>
</tr>

<tr>
<td class="org-left">map</td>
<td class="org-left">[] vector</td>
<td class="org-left">map are a list of these</td>
</tr>

<tr>
<td class="org-left">(me . mine)</td>
<td class="org-left">( . ) alist</td>
<td class="org-left">name something for later use</td>
</tr>

<tr>
<td class="org-left">anything</td>
<td class="org-left">'</td>
<td class="org-left">quote operate to include by ref</td>
</tr>
</tbody>
</table>

<p>
Table cells are just lists of sexp referencing or defining stuff. The
expressions should result in a literal or a quoted expression.  If an
expression, it is to be resolved when the action token is in scope
(e.g. at play-time) such that the REPL can be queried for information,
e.g. about the character acting (if any), party, etc.  The result of
loading an individual table is a symbol containing references and
expressions which compose one particular aspect of the game, say
Spells e.g. treasure for wizards, which in combination with the
definition statement for the spells table, provides enough information
to resolve the event (notwithstanding dm-interactive and
dm-interactable).
</p>

<p>
Inside map cells go the relationships to other map-cells and features
such as secret doors.  As discussed elsewhere these can likely be
similar to text or overlay properties but are ultimately probably
stored as plain data (e.g. the text description of the space, if any)
with properties which contain any custom behaviour written for the
map.
</p>

<p>
For general use items, for example items that could appear on more
than one treasure table, we can use a-lists to create lists.  By
allowing an expression as both car and cadr we can potentially use
this as the basis for key REPL statements such as update-table.
</p>

<p>
Generally speaking things will resolve down to named symbols that
identify them based on label's provided by the DM or by the REPL on
behalf of players.  This maybe makes adding important creature
comforts like code-completion and font-lock easier to support.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Corwin Brust</p>
<p class="date">Created: 2019-12-25 Wed 08:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
